fe40/tutorials/rheoFoam/OtherTests/Channel2D_VE/PTTlinearLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	type            fixedValue;
	value           uniform (1 0 0);
    }
    
    walls
    {
	type            fixedValue;
	value           uniform (0 0 0);    
    }

    outlet
    {
	type            zeroGradient;       
    }

    frontAndBack
    {
	type            empty;   
    }
}

// ************************************************************************* //
